# 별 찍기 - 23

'''
문제
예제를 보고 규칙을 유추한 뒤에 별을 찍어 보세요.

입력
첫째 줄에 N(2 ≤ N ≤ 100)이 주어진다.

출력
규칙대로 별을 출력한다.
'''

n = int(input())

for i in range(1, n + 1):
    if i == 1 or i == 2 * n:
        print("*" * n + " " * (2 * (n - 1) - 1) + "*" * n)
    elif i != n:
        print(" " * (i - 1) + "*" + " " * (n - 2) + "*" + " " * (2 * (n - i) - 1) + "*" + " " * (n - 2) + "*")
    else:
        print(" " * (i - 1) + "*" + " " * (n - 2) + "*" + " " * (2 * (n - i) - 1) + " " * (n - 2) + "*")

for i in range(n, 0, -1):
    if i == 1 or i == 2 * n:
        print("*" * n + " " * (2 * (n - 1) - 1) + "*" * n)
    elif i != n:
        print(" " * (i - 1) + "*" + " " * (n - 2) + "*" + " " * (2 * (n - i) - 1) + "*" + " " * (n - 2) + "*")