# 외심과 내심은 사랑입니다

'''
문제
수진이는 외심과 내심 없이는 살 수 없다고 말할 정도로 외심과 내심을 사랑한다. 하지만, 갑자기 수진에게 어려운 일이 닥쳤다. 바로 평면에 있는 삼각형 ABC에서 외접원의 반지름의 길이 R이고, 내접원의 반지름의 길이 r일 때, (외심과 내심 사이의 직선 거리)2의 값을 구하는 것이다. 수진이가 포기를 하면, 외심과 내심을 더 이상 사랑하지 않을 수도 있기 때문에, 우리가 수진이를 도와주는 프로그램을 작성하자!

입력
첫째 줄에 R과 r의 값이 사이에 공백을 한 개 두고 차례대로 주어진다. (단, R과 r의 값은 100,000 이하의 양의 정수이고, 2×r ≤ R을 만족한다.)

출력
첫째 줄에 (외심과 내심 사이의 직선 거리)2의 값의 정수 부분을 출력한다. (단, 어떤 수의 정수 부분은 그 수를 넘지 않는 최대의 정수를 말한다.)
'''

R, r = map(int, input().split())
res = (R * (R-2*r))
print(res)