# 모형 로켓의 높이

'''
문제
모형 로켓이 얼마나 높이 올라갔는지 측정하는 방법은 여러 가지가 있는데, 그 중 하나는 다음과 같다.
관측하는 사람 A,B,C가 D 만큼 떨어져서 경위계를 가지고, 수평선에서 떨어진 각도를 측정한다. 각 측정 장비는 지면에서 H만큼 떨어져 있다. 로켓이 발사된 후 가장 높은 지점 근처에서, 낙하산을 펼친 후, 먼지 더미를 분출한다. 각각의 관측자는 먼지 더미와 수평선과의 각도를 측정한다.
A,B,C가 측정한 각을 각각 a,b,c라 하면 이 값을 이용하여 높이를 측정할 수 있다.
D,H,a,b,c가 주어졌을 때, 로켓이 올라간 높이(반올림)를 계산하는 프로그램을 작성하시오.

입력
첫 줄은 10진수 D,H가 들어온다. (정수가 아닐 수 있다) 이 값들은 모든 로켓에 대해 같다. 다음 줄부터 각 줄에는 a,b,c(각도)가 들어오며, 마지막 줄에는 0보다 작거나 같은 값이 들어온다. 입력의 마지막을 나타내는 마지막 줄을 제외하고는 모두 0도 초과부터 90도 미만 사이의 각이다.

출력
각각의 3개의 각에 대해 높이를 반올림 하여 정수로 출력한다.
'''

import sys; input = sys.stdin.readline
from math import tan, radians

D, H = map(float, input().split())
while True:
    a, b, c = map(float, input().split())
    if not a:
        break

    a1 = tan(radians(a)) ** 2
    a2 = tan(radians(b)) ** 2
    a3 = tan(radians(c)) ** 2
    print(format(((2 * D ** 2 * a1 * a2 * a3) / (a1 * a2 - 2 * a1 * a3 + a2 * a3)) ** 0.5 + H, '.0f'))